## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # kubernetes_ingress_v1.argocd_ingress will be created
+   resource "kubernetes_ingress_v1" "argocd_ingress" {
+       id     = (known after apply)
+       status = (known after apply)

+       metadata {
+           annotations      = {
+               "kubernetes.io/ingress.class" = "nginx"
            }
+           generation       = (known after apply)
+           name             = "argocd-ingress"
+           namespace        = "default"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           default_backend {

+               service {
+                   name = "argocd"

+                   port {
+                       number = 80
                    }
                }
            }

+           rule {
+               host = "argocd.wayofthesys.org"

+               http {
+                   path {
+                       path      = "/*"
+                       path_type = "ImplementationSpecific"

+                       backend {

+                           service {
+                               name = "argocd-argo-cd-serve"

+                               port {
+                                   number = 80
                                }
                            }
                        }
                    }
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
